#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-WTM1hzdzEzU91z2t

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0910038a49c12d82d]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3599163775]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-fc4ce679-1bd5-4356-946b-52ca41953afe]
aws_instance.composer_internal: Refreshing state... [id=i-0141992e08b383232]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-1359284221]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-42780690-1a09-41dc-8b3a-ecc442126664]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.schutzbot_receiver_lambda_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "schutzbot_receiver_lambda_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./schutzbot_receiver.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./lambda/"
      + type                = "zip"
    }

  # data.aws_iam_policy_document.schutzbot_receiver_cloudwatch will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "schutzbot_receiver_cloudwatch"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PozorbotCloudwatch"
        }
    }

  # data.aws_iam_policy_document.schutzbot_receiver_consumer_sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "schutzbot_receiver_consumer_sqs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "SchutzbotReceiverConsumerSQS"
        }
    }

  # data.aws_iam_policy_document.schutzbot_receiver_sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "schutzbot_receiver_sqs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:GetQueueAttributes",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PozorbotSQS"
        }
    }

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "1384655871" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4a4+rOLb290j9H3jTW3pntA8JlyRVqelqTUggV0gwGAJzRpEBJxAcoMDktnv/9yNyqaldu3bPjOZIR11fUrbXzY+f5bVMP00oTihrnjL8xOxKQqMM5bS5i444+AvjpWUSoPz0XFfHqizNoTboAadeq0ashfMiSpMnhm9wP9V+qrHsW6Gfanfbg6jI0iKiF1lEKfLDHU7oX5h1RHCCdvi5HiURbfjrTf0fWmaOkmKNc1ZO/DSIks0T8+BF9I3AJWSKj7Tpk7QMWD9N1tHmp5oa7fB3wf38VqZWKwucF081hmGZKoInBvsCW03WGIZhiiJcoZKGaR6dcbCK8ekiW/2xTL0oQjYvENPr9XqSqJ1Rnz/5glwNBz29J/V6vX5P7x+3a2U8JsN1P+lGPhmddnYuS7kJBTLr0NgYmjzOHoL+4nzgt07HTkKdLJZqhhd5pB21JRk++va82wRKJgXcuasctNPneL0Ju+vypDmt7vizijrzk2lJm3aopcpxDZbDdjSiftPQSeLJSjTNjLhFoixt6S6V6G7Te9nERq8zOIenjdcp22o3OprjY8uWtqWhcsOlfta2GV6fIrv8XIzB51CAuR5Pe1JZjh3dy7fksxJaOzTb5/uTORfKYk73iSNtQ29xOM0fBHuxRdk0aHZDE70sZP6gnDpQEZKl31psDtwm0r1OEXmKeX7QTHy0xbbefXzJ9LmtOlM/27g5MdBoNHUNNaTn+YMauPl8psBlavA93Du1NiH1tXwumcRrG/vFg3g+cy8SUAS/P2/NuUPWPhxeFuH+ICTUEzNztqABppPPVpvTF0mWLE+GkbiZcFYOPhZ4b3nsPCRhlyThLHc3W/zgp3qy6CnHpk/EjmxMTpuoXPjS4XPMPzolcdQlfEESjQ+TWQy2g2xrLgXcVid8Jx08FJOR32ra7fi0nu0DtbDC4IXvL0dDy5pn53Tjcd225UQcWCpZ4oImj61Nvwk+29aJOmvnkcvX1twPeqkwdNfJpH12AFxOJl3VjVFyPIryA5xHsTzRugXcChx37vRPJ268Hr+Y3oSX2uuHdSAiH+Sz1sB3YKCMm7x00uyOwm8ffDfqDeeTqeadlwpninT9eOQwrz8/Mzu0TfO/5jgIEW346a7+Ld9xILTbfPfC+f6V88QdjHnNlNvV3Hgh8VuFtLKOYkrRcWR2DvO4s3xMtk33AacLTZebKneYth7bUyb1ygBF3zirHfKI4lV1I9zSMkM0fGKadJdd03tV3RGrPcqLS2T+9RZ4Yn67BTo3JDieDVb9uaqOzedH0UfrR47DbaEttLwW31o/rNveuo0wF4h+lxf8xy7fFW7a/bm6mBsyuKs/rNtY7ARBt/XIt7k18lseJ3bEjt8JxK7nPXSwgB/5YP3eeW/Vl4H5PDM4OjP4PoDBxIykAbAm0IDuROcUCC5rHO3H/MSAQLZkbaDb7tLlFNGAE8nliAUHmq4KzlmzpCGM27wnuBzeqW1zEAtgGEJPAFLAAWDDbObx2QSN3K0ZKwDAw1QnihRw7guwLE2PyUg3FQtARQy4Y6Ry7cxVgsLns4G2dLeerYnGMNyaMf+iL4OFJVsd0wIuhrxsmdoSDbW5ucyk4JBVa61v1mJlaVoTEHBWYkNgQ0uRgaxwwU49GVsltMQwN4dcG1tZR+c0CXJEBIriGjHd2zFJg502719invQhVGRXCBQoK/JF1u4OqrEeK5qeSLltKY5haapzDme2nWnQIglOJDCHmqTyk5m6C8ZgIB2dpXIOtpupY022VqwKGlHbbhweAYRHBI+WLT+K6mAC8NY6IyFLVTE7miMygttQhMTZzwRtotrjo7+VLGxlpsMdkcr7omVlJ/2QctoA7BwxPZtL0vIUrWPxlgt5KdFjMkPDQJqPFOqTzFDt7s6xwQmPLMPs07MXu7Jh05Yq+rlzVqauZZXqTitUJcj6xOLswWQEeHcASKCZgrJ3Y5DbijUAiTUzRsEU2sHQHIGzIWvItrVdQALbUDKkxa1WwAUHlSjINsdt5xzy3lJ6Ua3eFMpuYctqyx0qyJT50FZIBExJM5bAVmVtbCSSCDhycBJSehaBXp+eQWIJ3gDsrSF/wqN0j5dhx5eBYMX8wo+ViadnLU8oRJ9Y1BpZMRhaCuQnfVMIJBVS3oG8YY2s0FhKwDtPYk90j9Nz7wh2zlmHrZMFNSngLEm3lbkl80OwDMbQInKfuIYqd/s6IQqIU9E1XUcV44M77Ba+0Z06xM2cmGSBAErI93It5vtzOZBUy4qNZQBsyPcdqAyNbUA0sjljU4o94TD9ga501wXLQNGjrgihq+mQ7+u20/o4r46vHNU3mQSSTNAEQgzOb3tKNvPj8cm0eYRk5WjIRMX2MTRFYvumL4Iz6ZvWBIJEO9gJ5NTRWAQ8EB0OpMFuwwOo7Q1Fifq7Yx6YkqPBruNyQLBHWt8fdofGaCKoMl0Y9tHUeGuqLp2DNiz2BiGJPfJzb5hBa6Tu58vs4G1Dw9odqT+Ce8DxC9OEU2hPRrBP52hrIf9s7QDnLpHcEk1zzEObWvPBZOqNQmLESgGX4VgXjgM4tFow1jTHVNrasidaw3YyH0gzgwQctiR9rmccFAJNT3qiZlmGaz9yGoQtKGcnI+md0YjsNWXSmlsTAAR6wrZmGMtgp8ehgMRQM3Zu6QuqaBtdQbMJD7YhxTLf6W81zonT9pTL2gAqvDFKj04c8D7UnKmoTKEFYNDvAu/snII4WDowbkPenTlEbTlWqOrnyVxLlC2yJ0d/C1vuFshGrE+NRCtM41H0R1rb3yp7bQk4J56UGol5fal2+9H1TgawLY9lTYEETEBMBroFlOtdzk3fV4rR3DCf8ZHiPEGkUVC0iZJNVc2ytMB5Iy28MiJBI8037zV7gwGQDeOZfxAaIt/otBo8f5Ox52Aqg5VhzFZT2TFWPaA9ozx5QofiqcB+jmmxQwna4PypLFiMCsryT11RfGgLfPeh2+3epJ4KnO8jH196V3YsDEU7vbkwoGT0wXhhjufaSu1pveGt7PW0wX/gr/QKP4+yqstnbyqsn+52KAnYWHdI2r37dwxTVi/waT1VXi2ArIyXzzcA2Tui7CHN41s//ga7wRg8NzH1mzd82Tvgd+tyH8im8boxWRss5mPNXEEwew4pzYqnZvPbnTVed9ZAO3ROE3QoqnNsvu1DPnL53USDpjvycXvytzjdRn+/DRAh6QEHqyDdoSgpmGfmb0ydYrR7y5r6fzH1sPQaXo4P7+ev2Hy/xNw9+Ih5ZuofR+0j1s9pI8NV33WL7mrw347vfy2Od0jvsU/T/Pbze6gWaZn7uGhs07IiTXD3S08Zrjzf5+/tLD76pAzwqkwietlX/ebjli/1v79CUkRJXDTSkr63iQ7F6tKSHhD1wxVJN8XdfJRkJb3h9er6FQycBFkaJbQycqdipf1DAt7NbvK0zFbVQ7VSvWXK6p4pd6mC5hjtXsWuZ7MqTgVJN6/7vz2mG34aYP+CUJEm9VotLxN/F1xb7+JUULzzKWFwgjyCGZZN0gNzRep3Hvr/zpP9yBYhJuR6Z/zozf7/ml6UND1UhLUCU4bFZcpkUYbXKCK169F//EKo/cwMMWVoiJkoKShKfMyMB43aWDPMntaXV+PB86c/+WVOGHZWMNVhPDWbfKfbENqtxu23SRDFBW3uMEVsgChq3m2xUfDnykevKPCuAihMC1rh3qgpcDZ7vdue65++fHzdfWU/fXkTzNd6ZW6RV+RIy2vgCT68sYv9MGXqBqY0Sja3E3pdZmjKfPryjeuvjYtJ44bCO4VG7f5fdcoFpuyrqU/fmPljnPYNnGsJ8iqAXk+dpgwYaVcwAN5EBcX5t7w4RDS8yNSaZZE3SeojcokEHQrm20rBbDBlr1PsHpESM/9dJQx7T2y2ItSnL79Xg77eVG5WoqCS/ycV+SvzG7N9YdicqTeMi55B8yjZ1Jlfr4C8Lb6rW6yrW/FtVAleu6v/nmT9XzTG/MZcDinfMez6Xw2g9lGDcPsayLAsKmn6R+LaAGckPTFVd8Ws05y5XrbFlWe3xYpl92LH9HuMj3MarSMfUdyoeajAnRbDBgzL/PLLL8ynL+++IXxlfmU+fXnb93x9UzF/5CbGJwYlwbe+/q94/UEz+0+pfKtaFbDfMvcfC/WPJa+0fAX1e/SuCmyMTxcE3xn2c/ofGr4fzZu8+G43fzyKX/qxqjp8QPSqupTZG5Haz4w5H8z/tAvRKcDJn58YuypkOKjuYT9N9jiv6lFUVOOBZjBVic2ZQ4gT5oAZgsrEDxs1H9FLUtTfIH17NH19i35Vpb7WmV9/fRvCHwjiezkvsxuuzK0NveG7yHGGcsy8b53/f8HkeJdS/F7tkvtF6seYFo3aD/q4u7Wrids766/vYX16fOC478Bk2Z9q/xMAAP//DG/AwDQaAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=external.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://logs.us-east-1.amazonaws.com/"
                      group_name = "staging_external"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "3169933157" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4a5OjOJb2d0f0f+B1V8Q7E7XYXIwzndPZMcYGX8FGIDDMTjgEyAYjAwnytbr++wa+5GRmVdfM7G7ERucXJ9I5zzk8eqRzRC9LKU4pa51y/MRsd4TGOSpocxsfcfgXxs92aYiK03NdG2mKPIN6vwvceq16Ym1clHGWPjF8g/up9lONZd8a/VS7Y/fjMs/KmF5sEaUoiLY4pX9hVjHBKdri53qcxrQRrNb1f3hZBUrLFS5YJQ2yME7XT8yDH9M3BpeUKT7SZkCyXcgGWbqK1z/VtHiLv0nu57c2tdquxEX5VGMYlqkyeGJwILDVYI1hGKYsoyXa0Sgr4jMOlwk+XWyrP5apl2XEFiViut1uVxb1M+rxp0BQqsd+1+jK3W631zV6x81KHY3IYNVLO3FAhqetUyhyYUGBTNs0MQcWj/OHsDc/H/iN23bSyCDzhZbjeRHrR31BBo+BM+s0gZrLIXfuqAf99DlZraPOanfS3VZn9FlD7dnJsuW1FOmZelyBxUCKhzRomgZJfUWNJ7mZtEicZy3DozLdrrsv68Tstvvn6LT22ztJ68RHa3RsOfJmZ2rcYGGc9U2OV6fY2X0uR+BzJMDCSCZdebcbuYZfbMhnNbK3aLov9idrJuzKGd2nrryJ/PnhNHsQnPkG5ZOw2Yks9DJX+IN6akNVSBdBa74+cOvY8Ntl7KvW+UG38NERJaPz+JIbM0dzJ0G+9gpiouFw4plaRM+zBy30itlUhYvM5Lu4e2qtIxroxUy2iC+Z+/mDeD5zLzJQhaA3a824Qy4dDi/zaH8QUuqLuTWd0xDT8Wdb4ox5mqeLk2mmXi6c1UOABd5fHNsPadQhaTQtvPUGPwSZkc676rEZELGtmOPTOt7NA/nwOeEf3R1xtQV8QTJNDuNpAjb9fGMtBCxpY76d9R/K8TBoNR0pOa2m+1Ar7Sh84XuL4cC2Z/k5W/tcR7LdmAMLNU890OSxve41wWfHPlF35T5yxcqeBWE3EwbeKh1LZxfAxXjc0bwEpcejqDzAWZwoY71Two3Aced273TiRqvRi+WPeVlaPaxCEQWgmLb6gQtDddTk5ZPutFV+8xB4cXcwG090/7xQOUukq8cjh3nj+ZnZok1W/LXAYYRoI8i29fd6x6EgSXznovneVfPE64943VKkamw0l/mNSlp5W7Xk+Di02odZ0l48ppum94CzuW4oTY07TFqP0oTJ/F2I4nfBaocipnhZnQi3bZkjGj0xTbrNr9t7WZ0Ryz0qyktmwfUUeGJ+uyU6M2U4mvaXvZmmjaznRzFAq0eOw5IgCS2/xbdWDyvJX0kIc6EYdHgheOzwHeHm3Ztp85mpgLv7w0rCYjsMO61HXuJWKGj5nNgW20E7FDu+/9DGAn7kw9XH4N1lTwHW89Tk6NTkewCGYyuW+8AeQxN6Y4NTIbjMcbSX8GMTAsVW9L7heAuPU0UTjmWPIzbs64YmuGfdlgcwkXhf8Di81SSrnwhgEEFfAHLIAeDAfOrz+RgNvY2VqADAw8Qgqhxy3guwbd1IyNCwVBtAVQy5Y6xxUu6pYRnweV9feBvf0UVzEG2shH8xFuHcVuy2ZQMPQ16xLX2BBvrMWuRyeMiruda7uURdWPYYhJydOhA40FYVoKhcuNVO5kaNbDEqrAEnYTtvG5wuQ46IQFU9M6F7JyFZuNVnvUvO4x6EquIJoQoVVbnYOp1+9Wwkqm6kcuHYqmvauuaeo6nj5Dq0SYpTGcygLmv8eKptwxHoy0d3oZ7DzXri2uONnWiCTjTJS6IjgPCI4NF2lEdR648B3thnJOSZJuZHa0iGcBOJkLj7qaCPNWd0DDayje3ccrkj0vhAtO38ZBwyTu+DrStmZ2tBWr6qt23e9iAvp0ZCpmgQyrOhSgOSm5rT2boOOOGhbVo9evYTTzEd2tLEoHDP6sSz7Z221UtNDfMesTmnPx4C3usDEuqWoO69BBSOavdBak/NYTiBTjiwhuBsKjpyHH0bktAx1RzpSasVcuFBIypyrJHkniPeX8gvmt2dQMUrHUVreQMVWQofOSqJgSXr5gI4mqKPzFQWAUcObkp2vk2g36NnkNqC3wd7e8Cf8DDb40XUDhQg2Ak/DxJ17Bt5yxdKMSA2tYd2Aga2CvlxzxJCWYOUdyFv2kM7Mhcy8M/jxBe94+TcPYKtezZg62RDXQ45WzYcdWYr/AAswhG0idIjnqkpnZ5BiAqSTPQsz9XE5OANOmVgdiYu8XI3IXkogB3ku4We8L2ZEsqabSfmIgQO5HsuVAfmJiQ6WZ+xJSe+cJj8jq989wWLUDXijgihpxuQ7xmO2/r+vjq+atRY5zJIc0EXCDG5QPLVfBoko5Pl8Agp6tFUiIadY2SJxAmsQARn0rPsMQSpfnBSyGnDkQh4ILocyMLtmgdQ35uqGve2xyK0ZFeHHdfjgOAM9V4w6AzM4VjQFDo3naOl8/ZEW7gHfVDuTUJSZxgU/iCH9lDbzxb5wd9Epr090mAI94Dj55YFJ9AZD2GPztDGRsHZ3gLOWyClJVrWiIcOtWf98cQfRsRM1BIuopEhHPtwYLdgouuupUr6oivaAymd9eWpSUIO27IxM3IOCqFupF1Rt23Tcx45HcIWVPKTmXbPaEj2ujpuzewxAAI9YUc3zUW4NZJIQGKkm1tvFwia6JgdQXcIDzYRxQrf7m10zk0yacLlEoAqbw6zo5uEfAB1dyKqE2gDGPY6wD+7pzAJFy5MJMh7U5doLdeONOM8numpukHO+BhsYMvbAMVMjImZ6qVlPorBUJeCjbrXF4Bzk/FOJwlvLLROL76eyQBKykjRVUjAGCSkb9hAvZ7l3ORjpRjOTOs5TikuUkQaJUXrOF1X1SzPSlw0stLfxSRsZMX6o2e33weKaT7zXEPkGvxjg+dvJs4MTBSwNM3pcqK45rIL9GdUpE/oUD6VOCgwLbcoRWtcPO1KFqOSsvxTRxQfJIHvPHQ6nZvVk1/gw6VvZR9UiDG54ZtQNntgNLdGM32pdfXu4Fbyunr/vx+s3PllUMR51eGzNxc2yLZblIZsYrgk69zju6alaBfq9K6mLOdAUUeL5xt57J1N9pAVya0Xf8NbfwSem5gGzRu37J3sO7rSA4plvr6Yovfns5FuLSGYPkeU5uVTs7nPA8xyIS/yUkvk2lKr4/NByHbOx+LhLO0b79+88frmjcqxgbbonKXoUFYL3XzbqHwvr28GGjTbku/3L39Lsk3899sDIiQ74HAZZlsUpyXzzPyNqVOMtm9lVf8Pph7t/Ea11h/HrwR+O8XcIwSIeWbq3886QGxQ0EaOq8bslt0V8N/O738tjw9M73FAs+L28yNWy2xXBLhsbLJdpazwHpeeclxFvo/f+118DMguxMtdGtPLe9VvMUpc7OMA1//+SkkZp0nZyHb0IyY6lMtLz3pANIiWJFuXd/g4zXf0xtdr6FcycBrmWZzSCuS9XnnMibyPJE4Ukc8FEotf9uvsuBcaFfqPVXqPvS6yXb6srrsV/m3PLe977m5V0gKj7avZdQGX5akk2fqVpNuVvBFkIQ4uNJZZWq/Vil0abMNrA1+eSoq3ASUMTpFPMMOyaXZgrnT+4HPBv3PxP7JlhAm5nj6/d/P/f00/Tps+KqNaiSnD4l3G5HGOVygmtas+vn/PqP3MDDBlaISZOC0pSgPMjPqN2kg3ra7eU5aj/vOnPwW7gjDstGSqFXtqNvl2pyFIrcbtt0kQxSVtbjFFbIgoat6x2Dj8cxWjW5Z4WxEUZSWteG/UVDidvp6Sz/VPX75/cH5lP315k8zXegU3LyoFZbtr4ik+vMHFQZQxdRNTGqfr2wq9TjM0Yz59eRf6a+MCad5Y+ODQqN3/q1a5xJR9hfr0DuaPsdo3cq7FzK8Iel11mjFgqF/JAHgdlxQX73VxiGl0sak1d2XRJFmAyCUTdCiZ9zWFWWPKXofYPSI7zPxntWHY++5nK0F9+vKjavb15nJDicPK/p/U9q/Mb8zmhWELpt4wL34mLeJ0XWd+vRLytowvb7kub2W8UW3w2t39R5b1fxGM+Y25LFKxZdjVv5pA7Xutxu2bIsOyaEezP5LW+jgn2Ymp+jRmlRXM9bAtrzq7TVYqu1dEptdlAlzQeBUHiOJGzUclbrcYNmRY5pdffmE+ffnwJeIr8yvz6cvbDurrm7L6e2ESfGJQGr6P9X+l6+/0xP9UyreqVRH7Xrn/mKh/3/Iqy1dSv2Xv6sAm+HRh8ANwUND/IfB9ad7si2/e5o8n8UvTVlWH7wi9qi67/I1J7WfGmvVnf9pG6BTi9M9PjFMVMhxW53CQpXtcVPUoLqvnvm4yVYktmEOEU+aAGYJ2aRA1agGil01Rf8P07er19S37VZX6Wmd+/fVtCn8giu/lfJffeGVuveqN33mBc1Rg5mN//f9LpsDbjOKPbpe9X2ZBgmnZqP1OH3dHu0Lcbmx//Ujr0+MDx31DJsv+VPuvAAAA//8PyKwZehoAAA==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=internal.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                      group_name = "staging_internal"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "d3da00eef76c5086b070fe65de6b25fe5d87b2295804df95e364f02bfdc9333b" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=external.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://logs.us-east-1.amazonaws.com/"
                  group_name = "staging_external"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "7adeed9dad1c58985e93bcbf2a4946764e40e85a164d5612f24fced7ab3f34ce" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=internal.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                  group_name = "staging_internal"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.schutzbot_receiver_integration will be created
  + resource "aws_api_gateway_integration" "schutzbot_receiver_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.schutzbot_receiver_method will be created
  + resource "aws_api_gateway_method" "schutzbot_receiver_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.schutzbot_receiver_resource will be created
  + resource "aws_api_gateway_resource" "schutzbot_receiver_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "resource"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.schutzbot_receiver_api will be created
  + resource "aws_api_gateway_rest_api" "schutzbot_receiver_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "schutzbot-receiver-api-staging"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_cloudwatch_log_group.schutzbot_receiver_logs will be created
  + resource "aws_cloudwatch_log_group" "schutzbot_receiver_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/schutzbot_receiver_staging"
      + retention_in_days = 0
      + tags              = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Schutzbot staging"
          + "ServiceOwner" = "Image Builder"
        }
    }

  # aws_iam_policy.schutzbot_receiver_cloudwatch will be created
  + resource "aws_iam_policy" "schutzbot_receiver_cloudwatch" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "schutzbot_receiver_cloudwatch_staging"
      + path   = "/"
      + policy = (known after apply)
    }

  # aws_iam_policy.schutzbot_receiver_consumer_sqs will be created
  + resource "aws_iam_policy" "schutzbot_receiver_consumer_sqs" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "schutzbot_receiver_consumer_sqs_staging"
      + path   = "/"
      + policy = (known after apply)
    }

  # aws_iam_policy.schutzbot_receiver_read_secrets will be created
  + resource "aws_iam_policy" "schutzbot_receiver_read_secrets" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "schutzbot_receiver_read_secrets_staging"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:933752197999:secret:schutzbot_receiver-788D0L"
                      + Sid      = "WorkerReadSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.schutzbot_receiver_sqs will be created
  + resource "aws_iam_policy" "schutzbot_receiver_sqs" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "schutzbot_receiver_sqs_staging"
      + path   = "/"
      + policy = (known after apply)
    }

  # aws_iam_role.schutzbot_receiver_lambda_role will be created
  + resource "aws_iam_role" "schutzbot_receiver_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "schutzbot_receiver_lambda_role_staging"
      + path                  = "/"
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Schutzbot receiver lambda role - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.schutzbot_receiver_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "schutzbot_receiver_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "schutzbot_receiver_lambda_role_staging"
    }

  # aws_iam_role_policy_attachment.schutzbot_receiver_lambda_secrets will be created
  + resource "aws_iam_role_policy_attachment" "schutzbot_receiver_lambda_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "schutzbot_receiver_lambda_role_staging"
    }

  # aws_iam_role_policy_attachment.schutzbot_receiver_sqs will be created
  + resource "aws_iam_role_policy_attachment" "schutzbot_receiver_sqs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "schutzbot_receiver_lambda_role_staging"
    }

  # aws_iam_user.schutzbot_receiver_consumer will be created
  + resource "aws_iam_user" "schutzbot_receiver_consumer" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "schutzbot_receiver_consumer_staging"
      + path          = "/"
      + tags          = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Schutzbot Receiver Consumer - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.schutzbot_receiver_consumer will be created
  + resource "aws_iam_user_policy_attachment" "schutzbot_receiver_consumer" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "schutzbot_receiver_consumer_staging"
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ ami                          = "ami-0125847424873568f" -> "ami-0cbbe767efb2654f9" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0910038a49c12d82d" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0910038a49c12d82d" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0244d0158cf08f24a" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-0125847424873568f" -> "ami-0cbbe767efb2654f9" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0141992e08b383232" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0141992e08b383232" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09804a726af0a1de7" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_lambda_function.pozorbot_lambda will be updated in-place
  ~ resource "aws_lambda_function" "pozorbot_lambda" {
        id                             = "pozorbot_staging"
      ~ last_modified                  = "2021-01-27T18:13:24.446+0000" -> (known after apply)
      ~ source_code_hash               = "QbcgPUs6V8Tz6mojUxVBqhteZa4K1BbJ4bXWdK/MyJM=" -> "2crRPTYwwAMYoP2LRvalcp+vU6KYyZNaB1ZpC0Q9Hvo="
        tags                           = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Pozorbot lambda staging"
            "ServiceOwner" = "Image Builder"
        }
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.schutzbot_receiver_lambda will be created
  + resource "aws_lambda_function" "schutzbot_receiver_lambda" {
      + arn                            = (known after apply)
      + filename                       = "schutzbot_receiver.zip"
      + function_name                  = "schutzbot_receiver_staging"
      + handler                        = "schutzbot_receiver.github_webhook_endpoint"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Schutzbot receiver lambda staging"
          + "ServiceOwner" = "Image Builder"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SECRET_NAME"   = "schutzbot_receiver"
              + "SECRET_REGION" = "us-east-1"
              + "SQS_QUEUE"     = "schutzbot-receiver-queue-staging"
              + "SQS_REGION"    = "us-east-1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.schutzbot_receiver_permission will be created
  + resource "aws_lambda_permission" "schutzbot_receiver_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "schutzbot_receiver_staging"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 14 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ image_id                = "ami-0125847424873568f" -> "ami-0cbbe767efb2654f9"
      ~ latest_version          = 14 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4a4+rOLb290j9H3jTW3pntA8JlyRVqelqTUggV0gwGAJzRpEBJxAcoMDktnv/9yNyqaldu3bPjOZIR11fUrbXzY+f5bVMP00oTihrnjL8xOxKQqMM5bS5i444+AvjpWUSoPz0XFfHqizNoTboAadeq0ashfMiSpMnhm9wP9V+qrHsW6Gfanfbg6jI0iKiF1lEKfLDHU7oX5h1RHCCdvi5HiURbfjrTf0fWmaOkmKNc1ZO/DSIks0T8+BF9I3AJWSKj7Tpk7QMWD9N1tHmp5oa7fB3wf38VqZWKwucF081hmGZKoInBvsCW03WGIZhiiJcoZKGaR6dcbCK8ekiW/2xTL0oQjYvENPr9XqSqJ1Rnz/5glwNBz29J/V6vX5P7x+3a2U8JsN1P+lGPhmddnYuS7kJBTLr0NgYmjzOHoL+4nzgt07HTkKdLJZqhhd5pB21JRk++va82wRKJgXcuasctNPneL0Ju+vypDmt7vizijrzk2lJm3aopcpxDZbDdjSiftPQSeLJSjTNjLhFoixt6S6V6G7Te9nERq8zOIenjdcp22o3OprjY8uWtqWhcsOlfta2GV6fIrv8XIzB51CAuR5Pe1JZjh3dy7fksxJaOzTb5/uTORfKYk73iSNtQ29xOM0fBHuxRdk0aHZDE70sZP6gnDpQEZKl31psDtwm0r1OEXmKeX7QTHy0xbbefXzJ9LmtOlM/27g5MdBoNHUNNaTn+YMauPl8psBlavA93Du1NiH1tXwumcRrG/vFg3g+cy8SUAS/P2/NuUPWPhxeFuH+ICTUEzNztqABppPPVpvTF0mWLE+GkbiZcFYOPhZ4b3nsPCRhlyThLHc3W/zgp3qy6CnHpk/EjmxMTpuoXPjS4XPMPzolcdQlfEESjQ+TWQy2g2xrLgXcVid8Jx08FJOR32ra7fi0nu0DtbDC4IXvL0dDy5pn53Tjcd225UQcWCpZ4oImj61Nvwk+29aJOmvnkcvX1twPeqkwdNfJpH12AFxOJl3VjVFyPIryA5xHsTzRugXcChx37vRPJ268Hr+Y3oSX2uuHdSAiH+Sz1sB3YKCMm7x00uyOwm8ffDfqDeeTqeadlwpninT9eOQwrz8/Mzu0TfO/5jgIEW346a7+Ld9xILTbfPfC+f6V88QdjHnNlNvV3Hgh8VuFtLKOYkrRcWR2DvO4s3xMtk33AacLTZebKneYth7bUyb1ygBF3zirHfKI4lV1I9zSMkM0fGKadJdd03tV3RGrPcqLS2T+9RZ4Yn67BTo3JDieDVb9uaqOzedH0UfrR47DbaEttLwW31o/rNveuo0wF4h+lxf8xy7fFW7a/bm6mBsyuKs/rNtY7ARBt/XIt7k18lseJ3bEjt8JxK7nPXSwgB/5YP3eeW/Vl4H5PDM4OjP4PoDBxIykAbAm0IDuROcUCC5rHO3H/MSAQLZkbaDb7tLlFNGAE8nliAUHmq4KzlmzpCGM27wnuBzeqW1zEAtgGEJPAFLAAWDDbObx2QSN3K0ZKwDAw1QnihRw7guwLE2PyUg3FQtARQy4Y6Ry7cxVgsLns4G2dLeerYnGMNyaMf+iL4OFJVsd0wIuhrxsmdoSDbW5ucyk4JBVa61v1mJlaVoTEHBWYkNgQ0uRgaxwwU49GVsltMQwN4dcG1tZR+c0CXJEBIriGjHd2zFJg502719invQhVGRXCBQoK/JF1u4OqrEeK5qeSLltKY5haapzDme2nWnQIglOJDCHmqTyk5m6C8ZgIB2dpXIOtpupY022VqwKGlHbbhweAYRHBI+WLT+K6mAC8NY6IyFLVTE7miMygttQhMTZzwRtotrjo7+VLGxlpsMdkcr7omVlJ/2QctoA7BwxPZtL0vIUrWPxlgt5KdFjMkPDQJqPFOqTzFDt7s6xwQmPLMPs07MXu7Jh05Yq+rlzVqauZZXqTitUJcj6xOLswWQEeHcASKCZgrJ3Y5DbijUAiTUzRsEU2sHQHIGzIWvItrVdQALbUDKkxa1WwAUHlSjINsdt5xzy3lJ6Ua3eFMpuYctqyx0qyJT50FZIBExJM5bAVmVtbCSSCDhycBJSehaBXp+eQWIJ3gDsrSF/wqN0j5dhx5eBYMX8wo+ViadnLU8oRJ9Y1BpZMRhaCuQnfVMIJBVS3oG8YY2s0FhKwDtPYk90j9Nz7wh2zlmHrZMFNSngLEm3lbkl80OwDMbQInKfuIYqd/s6IQqIU9E1XUcV44M77Ba+0Z06xM2cmGSBAErI93It5vtzOZBUy4qNZQBsyPcdqAyNbUA0sjljU4o94TD9ga501wXLQNGjrgihq+mQ7+u20/o4r46vHNU3mQSSTNAEQgzOb3tKNvPj8cm0eYRk5WjIRMX2MTRFYvumL4Iz6ZvWBIJEO9gJ5NTRWAQ8EB0OpMFuwwOo7Q1Fifq7Yx6YkqPBruNyQLBHWt8fdofGaCKoMl0Y9tHUeGuqLp2DNiz2BiGJPfJzb5hBa6Tu58vs4G1Dw9odqT+Ce8DxC9OEU2hPRrBP52hrIf9s7QDnLpHcEk1zzEObWvPBZOqNQmLESgGX4VgXjgM4tFow1jTHVNrasidaw3YyH0gzgwQctiR9rmccFAJNT3qiZlmGaz9yGoQtKGcnI+md0YjsNWXSmlsTAAR6wrZmGMtgp8ehgMRQM3Zu6QuqaBtdQbMJD7YhxTLf6W81zonT9pTL2gAqvDFKj04c8D7UnKmoTKEFYNDvAu/snII4WDowbkPenTlEbTlWqOrnyVxLlC2yJ0d/C1vuFshGrE+NRCtM41H0R1rb3yp7bQk4J56UGol5fal2+9H1TgawLY9lTYEETEBMBroFlOtdzk3fV4rR3DCf8ZHiPEGkUVC0iZJNVc2ytMB5Iy28MiJBI8037zV7gwGQDeOZfxAaIt/otBo8f5Ox52Aqg5VhzFZT2TFWPaA9ozx5QofiqcB+jmmxQwna4PypLFiMCsryT11RfGgLfPeh2+3epJ4KnO8jH196V3YsDEU7vbkwoGT0wXhhjufaSu1pveGt7PW0wX/gr/QKP4+yqstnbyqsn+52KAnYWHdI2r37dwxTVi/waT1VXi2ArIyXzzcA2Tui7CHN41s//ga7wRg8NzH1mzd82Tvgd+tyH8im8boxWRss5mPNXEEwew4pzYqnZvPbnTVed9ZAO3ROE3QoqnNsvu1DPnL53USDpjvycXvytzjdRn+/DRAh6QEHqyDdoSgpmGfmb0ydYrR7y5r6fzH1sPQaXo4P7+ev2Hy/xNw9+Ih5ZuofR+0j1s9pI8NV33WL7mrw347vfy2Od0jvsU/T/Pbze6gWaZn7uGhs07IiTXD3S08Zrjzf5+/tLD76pAzwqkwietlX/ebjli/1v79CUkRJXDTSkr63iQ7F6tKSHhD1wxVJN8XdfJRkJb3h9er6FQycBFkaJbQycqdipf1DAt7NbvK0zFbVQ7VSvWXK6p4pd6mC5hjtXsWuZ7MqTgVJN6/7vz2mG34aYP+CUJEm9VotLxN/F1xb7+JUULzzKWFwgjyCGZZN0gNzRep3Hvr/zpP9yBYhJuR6Z/zozf7/ml6UND1UhLUCU4bFZcpkUYbXKCK169F//EKo/cwMMWVoiJkoKShKfMyMB43aWDPMntaXV+PB86c/+WVOGHZWMNVhPDWbfKfbENqtxu23SRDFBW3uMEVsgChq3m2xUfDnykevKPCuAihMC1rh3qgpcDZ7vdue65++fHzdfWU/fXkTzNd6ZW6RV+RIy2vgCT68sYv9MGXqBqY0Sja3E3pdZmjKfPryjeuvjYtJ44bCO4VG7f5fdcoFpuyrqU/fmPljnPYNnGsJ8iqAXk+dpgwYaVcwAN5EBcX5t7w4RDS8yNSaZZE3SeojcokEHQrm20rBbDBlr1PsHpESM/9dJQx7T2y2ItSnL79Xg77eVG5WoqCS/ycV+SvzG7N9YdicqTeMi55B8yjZ1Jlfr4C8Lb6rW6yrW/FtVAleu6v/nmT9XzTG/MZcDinfMez6Xw2g9lGDcPsayLAsKmn6R+LaAGckPTFVd8Ws05y5XrbFlWe3xYpl92LH9HuMj3MarSMfUdyoeajAnRbDBgzL/PLLL8ynL+++IXxlfmU+fXnb93x9UzF/5CbGJwYlwbe+/q94/UEz+0+pfKtaFbDfMvcfC/WPJa+0fAX1e/SuCmyMTxcE3xn2c/ofGr4fzZu8+G43fzyKX/qxqjp8QPSqupTZG5Haz4w5H8z/tAvRKcDJn58YuypkOKjuYT9N9jiv6lFUVOOBZjBVic2ZQ4gT5oAZgsrEDxs1H9FLUtTfIH17NH19i35Vpb7WmV9/fRvCHwjiezkvsxuuzK0NveG7yHGGcsy8b53/f8HkeJdS/F7tkvtF6seYFo3aD/q4u7Wrids766/vYX16fOC478Bk2Z9q/xMAAP//DG/AwDQaAAA=" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 12 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ image_id                = "ami-0125847424873568f" -> "ami-0cbbe767efb2654f9"
      ~ latest_version          = 12 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4a5OjOJb2d0f0f+B1V8Q7E7XYXIwzndPZMcYGX8FGIDDMTjgEyAYjAwnytbr++wa+5GRmVdfM7G7ERucXJ9I5zzk8eqRzRC9LKU4pa51y/MRsd4TGOSpocxsfcfgXxs92aYiK03NdG2mKPIN6vwvceq16Ym1clHGWPjF8g/up9lONZd8a/VS7Y/fjMs/KmF5sEaUoiLY4pX9hVjHBKdri53qcxrQRrNb1f3hZBUrLFS5YJQ2yME7XT8yDH9M3BpeUKT7SZkCyXcgGWbqK1z/VtHiLv0nu57c2tdquxEX5VGMYlqkyeGJwILDVYI1hGKYsoyXa0Sgr4jMOlwk+XWyrP5apl2XEFiViut1uVxb1M+rxp0BQqsd+1+jK3W631zV6x81KHY3IYNVLO3FAhqetUyhyYUGBTNs0MQcWj/OHsDc/H/iN23bSyCDzhZbjeRHrR31BBo+BM+s0gZrLIXfuqAf99DlZraPOanfS3VZn9FlD7dnJsuW1FOmZelyBxUCKhzRomgZJfUWNJ7mZtEicZy3DozLdrrsv68Tstvvn6LT22ztJ68RHa3RsOfJmZ2rcYGGc9U2OV6fY2X0uR+BzJMDCSCZdebcbuYZfbMhnNbK3aLov9idrJuzKGd2nrryJ/PnhNHsQnPkG5ZOw2Yks9DJX+IN6akNVSBdBa74+cOvY8Ntl7KvW+UG38NERJaPz+JIbM0dzJ0G+9gpiouFw4plaRM+zBy30itlUhYvM5Lu4e2qtIxroxUy2iC+Z+/mDeD5zLzJQhaA3a824Qy4dDi/zaH8QUuqLuTWd0xDT8Wdb4ox5mqeLk2mmXi6c1UOABd5fHNsPadQhaTQtvPUGPwSZkc676rEZELGtmOPTOt7NA/nwOeEf3R1xtQV8QTJNDuNpAjb9fGMtBCxpY76d9R/K8TBoNR0pOa2m+1Ar7Sh84XuL4cC2Z/k5W/tcR7LdmAMLNU890OSxve41wWfHPlF35T5yxcqeBWE3EwbeKh1LZxfAxXjc0bwEpcejqDzAWZwoY71Two3Aced273TiRqvRi+WPeVlaPaxCEQWgmLb6gQtDddTk5ZPutFV+8xB4cXcwG090/7xQOUukq8cjh3nj+ZnZok1W/LXAYYRoI8i29fd6x6EgSXznovneVfPE64943VKkamw0l/mNSlp5W7Xk+Di02odZ0l48ppum94CzuW4oTY07TFqP0oTJ/F2I4nfBaocipnhZnQi3bZkjGj0xTbrNr9t7WZ0Ryz0qyktmwfUUeGJ+uyU6M2U4mvaXvZmmjaznRzFAq0eOw5IgCS2/xbdWDyvJX0kIc6EYdHgheOzwHeHm3Ztp85mpgLv7w0rCYjsMO61HXuJWKGj5nNgW20E7FDu+/9DGAn7kw9XH4N1lTwHW89Tk6NTkewCGYyuW+8AeQxN6Y4NTIbjMcbSX8GMTAsVW9L7heAuPU0UTjmWPIzbs64YmuGfdlgcwkXhf8Di81SSrnwhgEEFfAHLIAeDAfOrz+RgNvY2VqADAw8Qgqhxy3guwbd1IyNCwVBtAVQy5Y6xxUu6pYRnweV9feBvf0UVzEG2shH8xFuHcVuy2ZQMPQ16xLX2BBvrMWuRyeMiruda7uURdWPYYhJydOhA40FYVoKhcuNVO5kaNbDEqrAEnYTtvG5wuQ46IQFU9M6F7JyFZuNVnvUvO4x6EquIJoQoVVbnYOp1+9Wwkqm6kcuHYqmvauuaeo6nj5Dq0SYpTGcygLmv8eKptwxHoy0d3oZ7DzXri2uONnWiCTjTJS6IjgPCI4NF2lEdR648B3thnJOSZJuZHa0iGcBOJkLj7qaCPNWd0DDayje3ccrkj0vhAtO38ZBwyTu+DrStmZ2tBWr6qt23e9iAvp0ZCpmgQyrOhSgOSm5rT2boOOOGhbVo9evYTTzEd2tLEoHDP6sSz7Z221UtNDfMesTmnPx4C3usDEuqWoO69BBSOavdBak/NYTiBTjiwhuBsKjpyHH0bktAx1RzpSasVcuFBIypyrJHkniPeX8gvmt2dQMUrHUVreQMVWQofOSqJgSXr5gI4mqKPzFQWAUcObkp2vk2g36NnkNqC3wd7e8Cf8DDb40XUDhQg2Ak/DxJ17Bt5yxdKMSA2tYd2Aga2CvlxzxJCWYOUdyFv2kM7Mhcy8M/jxBe94+TcPYKtezZg62RDXQ45WzYcdWYr/AAswhG0idIjnqkpnZ5BiAqSTPQsz9XE5OANOmVgdiYu8XI3IXkogB3ku4We8L2ZEsqabSfmIgQO5HsuVAfmJiQ6WZ+xJSe+cJj8jq989wWLUDXijgihpxuQ7xmO2/r+vjq+atRY5zJIc0EXCDG5QPLVfBoko5Pl8Agp6tFUiIadY2SJxAmsQARn0rPsMQSpfnBSyGnDkQh4ILocyMLtmgdQ35uqGve2xyK0ZFeHHdfjgOAM9V4w6AzM4VjQFDo3naOl8/ZEW7gHfVDuTUJSZxgU/iCH9lDbzxb5wd9Epr090mAI94Dj55YFJ9AZD2GPztDGRsHZ3gLOWyClJVrWiIcOtWf98cQfRsRM1BIuopEhHPtwYLdgouuupUr6oivaAymd9eWpSUIO27IxM3IOCqFupF1Rt23Tcx45HcIWVPKTmXbPaEj2ujpuzewxAAI9YUc3zUW4NZJIQGKkm1tvFwia6JgdQXcIDzYRxQrf7m10zk0yacLlEoAqbw6zo5uEfAB1dyKqE2gDGPY6wD+7pzAJFy5MJMh7U5doLdeONOM8numpukHO+BhsYMvbAMVMjImZ6qVlPorBUJeCjbrXF4Bzk/FOJwlvLLROL76eyQBKykjRVUjAGCSkb9hAvZ7l3ORjpRjOTOs5TikuUkQaJUXrOF1X1SzPSlw0stLfxSRsZMX6o2e33weKaT7zXEPkGvxjg+dvJs4MTBSwNM3pcqK45rIL9GdUpE/oUD6VOCgwLbcoRWtcPO1KFqOSsvxTRxQfJIHvPHQ6nZvVk1/gw6VvZR9UiDG54ZtQNntgNLdGM32pdfXu4Fbyunr/vx+s3PllUMR51eGzNxc2yLZblIZsYrgk69zju6alaBfq9K6mLOdAUUeL5xt57J1N9pAVya0Xf8NbfwSem5gGzRu37J3sO7rSA4plvr6Yovfns5FuLSGYPkeU5uVTs7nPA8xyIS/yUkvk2lKr4/NByHbOx+LhLO0b79+88frmjcqxgbbonKXoUFYL3XzbqHwvr28GGjTbku/3L39Lsk3899sDIiQ74HAZZlsUpyXzzPyNqVOMtm9lVf8Pph7t/Ea11h/HrwR+O8XcIwSIeWbq3886QGxQ0EaOq8bslt0V8N/O738tjw9M73FAs+L28yNWy2xXBLhsbLJdpazwHpeeclxFvo/f+118DMguxMtdGtPLe9VvMUpc7OMA1//+SkkZp0nZyHb0IyY6lMtLz3pANIiWJFuXd/g4zXf0xtdr6FcycBrmWZzSCuS9XnnMibyPJE4Ukc8FEotf9uvsuBcaFfqPVXqPvS6yXb6srrsV/m3PLe977m5V0gKj7avZdQGX5akk2fqVpNuVvBFkIQ4uNJZZWq/Vil0abMNrA1+eSoq3ASUMTpFPMMOyaXZgrnT+4HPBv3PxP7JlhAm5nj6/d/P/f00/Tps+KqNaiSnD4l3G5HGOVygmtas+vn/PqP3MDDBlaISZOC0pSgPMjPqN2kg3ra7eU5aj/vOnPwW7gjDstGSqFXtqNvl2pyFIrcbtt0kQxSVtbjFFbIgoat6x2Dj8cxWjW5Z4WxEUZSWteG/UVDidvp6Sz/VPX75/cH5lP315k8zXegU3LyoFZbtr4ik+vMHFQZQxdRNTGqfr2wq9TjM0Yz59eRf6a+MCad5Y+ODQqN3/q1a5xJR9hfr0DuaPsdo3cq7FzK8Iel11mjFgqF/JAHgdlxQX73VxiGl0sak1d2XRJFmAyCUTdCiZ9zWFWWPKXofYPSI7zPxntWHY++5nK0F9+vKjavb15nJDicPK/p/U9q/Mb8zmhWELpt4wL34mLeJ0XWd+vRLytowvb7kub2W8UW3w2t39R5b1fxGM+Y25LFKxZdjVv5pA7Xutxu2bIsOyaEezP5LW+jgn2Ymp+jRmlRXM9bAtrzq7TVYqu1dEptdlAlzQeBUHiOJGzUclbrcYNmRY5pdffmE+ffnwJeIr8yvz6cvbDurrm7L6e2ESfGJQGr6P9X+l6+/0xP9UyreqVRH7Xrn/mKh/3/Iqy1dSv2Xv6sAm+HRh8ANwUND/IfB9ad7si2/e5o8n8UvTVlWH7wi9qi67/I1J7WfGmvVnf9pG6BTi9M9PjFMVMhxW53CQpXtcVPUoLqvnvm4yVYktmEOEU+aAGYJ2aRA1agGil01Rf8P07er19S37VZX6Wmd+/fVtCn8giu/lfJffeGVuveqN33mBc1Rg5mN//f9LpsDbjOKPbpe9X2ZBgmnZqP1OH3dHu0Lcbmx//Ujr0+MDx31DJsv+VPuvAAAA//8PyKwZehoAAA==" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210208204609849800000002" -> (known after apply)
      ~ id                                  = "sfr-fc4ce679-1bd5-4356-946b-52ca41953afe" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "14" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210208204619550400000004" -> (known after apply)
      ~ id                                  = "sfr-42780690-1a09-41dc-8b3a-ecc442126664" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "12" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_sqs_queue.schutzbot_receiver_queue will be created
  + resource "aws_sqs_queue" "schutzbot_receiver_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "schutzbot-receiver-queue-staging"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Schutzbot Receiver Message Queue - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + visibility_timeout_seconds        = 30
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-3599163775" -> (known after apply)
      ~ instance_id = "i-0910038a49c12d82d" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-1359284221" -> (known after apply)
      ~ instance_id = "i-0141992e08b383232" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # null_resource.schutzbot_receiver_prepare_lambda will be created
  + resource "null_resource" "schutzbot_receiver_prepare_lambda" {
      + id       = (known after apply)
      + triggers = {
          + "schutzbot_receiver_lambda" = "50e51c0c1b0d0dddcbe6575215f940488689bff8"
        }
    }

Plan: 25 to add, 3 to change, 6 to destroy.

Changes to Outputs:
  ~ rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-20210208203023 (ami-0125847424873568f)" -> "RHEL 8 pre-built: imagebuilder-service-image-PR-11-testing-only (ami-0cbbe767efb2654f9)"
```

</details>

*Pusher: @major, Action: `pull_request`*